Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/include/pio/pic32ck1025gc01064.h
#define PIN_PC01I_SDMMC1_SDDAT2                    _UINT32_(65)
#define MUX_PC01I_SDMMC1_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC01I_SDMMC1_SDDAT2                 ((PIN_PC01I_SDMMC1_SDDAT2 << 16) | MUX_PC01I_SDMMC1_SDDAT2)
#define PORT_PC01I_SDMMC1_SDDAT2                   (_UINT32_(1) << 1)

#define PIN_PC02I_SDMMC1_SDDAT3                    _UINT32_(66)
#define MUX_PC02I_SDMMC1_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC02I_SDMMC1_SDDAT3                 ((PIN_PC02I_SDMMC1_SDDAT3 << 16) | MUX_PC02I_SDMMC1_SDDAT3)
#define PORT_PC02I_SDMMC1_SDDAT3                   (_UINT32_(1) << 2)

#define PIN_PC03I_SDMMC1_SDWP                      _UINT32_(67)
#define MUX_PC03I_SDMMC1_SDWP                      _UINT32_(8) 
#define PINMUX_PC03I_SDMMC1_SDWP                   ((PIN_PC03I_SDMMC1_SDWP << 16) | MUX_PC03I_SDMMC1_SDWP)
#define PORT_PC03I_SDMMC1_SDWP                     (_UINT32_(1) << 3)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PC10C_SERCOM0_PAD0                     _UINT32_(74)
#define MUX_PC10C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PC10C_SERCOM0_PAD0                  ((PIN_PC10C_SERCOM0_PAD0 << 16) | MUX_PC10C_SERCOM0_PAD0)
#define PORT_PC10C_SERCOM0_PAD0                    (_UINT32_(1) << 10)

#define PIN_PD06C_SERCOM0_PAD0                     _UINT32_(102)
#define MUX_PD06C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PD06C_SERCOM0_PAD0                  ((PIN_PD06C_SERCOM0_PAD0 << 16) | MUX_PD06C_SERCOM0_PAD0)
#define PORT_PD06C_SERCOM0_PAD0                    (_UINT32_(1) << 6)

#define PIN_PC11C_SERCOM0_PAD1                     _UINT32_(75)
#define MUX_PC11C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PC11C_SERCOM0_PAD1                  ((PIN_PC11C_SERCOM0_PAD1 << 16) | MUX_PC11C_SERCOM0_PAD1)
#define PORT_PC11C_SERCOM0_PAD1                    (_UINT32_(1) << 11)

#define PIN_PD07C_SERCOM0_PAD1                     _UINT32_(103)
#define MUX_PD07C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PD07C_SERCOM0_PAD1                  ((PIN_PD07C_SERCOM0_PAD1 << 16) | MUX_PD07C_SERCOM0_PAD1)
#define PORT_PD07C_SERCOM0_PAD1                    (_UINT32_(1) << 7)

#define PIN_PC12C_SERCOM0_PAD2                     _UINT32_(76)
#define MUX_PC12C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PC12C_SERCOM0_PAD2                  ((PIN_PC12C_SERCOM0_PAD2 << 16) | MUX_PC12C_SERCOM0_PAD2)
#define PORT_PC12C_SERCOM0_PAD2                    (_UINT32_(1) << 12)

#define PIN_PD05C_SERCOM0_PAD2                     _UINT32_(101)
#define MUX_PD05C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PD05C_SERCOM0_PAD2                  ((PIN_PD05C_SERCOM0_PAD2 << 16) | MUX_PD05C_SERCOM0_PAD2)
#define PORT_PD05C_SERCOM0_PAD2                    (_UINT32_(1) << 5)

#define PIN_PC13C_SERCOM0_PAD3                     _UINT32_(77)
#define MUX_PC13C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PC13C_SERCOM0_PAD3                  ((PIN_PC13C_SERCOM0_PAD3 << 16) | MUX_PC13C_SERCOM0_PAD3)
#define PORT_PC13C_SERCOM0_PAD3                    (_UINT32_(1) << 13)

/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PD08C_SERCOM1_PAD0                     _UINT32_(104)
#define MUX_PD08C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PD08C_SERCOM1_PAD0                  ((PIN_PD08C_SERCOM1_PAD0 << 16) | MUX_PD08C_SERCOM1_PAD0)
#define PORT_PD08C_SERCOM1_PAD0                    (_UINT32_(1) << 8)

#define PIN_PD09C_SERCOM1_PAD1                     _UINT32_(105)
#define MUX_PD09C_SERCOM1_PAD1                     _UINT32_(2) 
#define PINMUX_PD09C_SERCOM1_PAD1                  ((PIN_PD09C_SERCOM1_PAD1 << 16) | MUX_PD09C_SERCOM1_PAD1)
#define PORT_PD09C_SERCOM1_PAD1                    (_UINT32_(1) << 9)

#define PIN_PD10C_SERCOM1_PAD2                     _UINT32_(106)
#define MUX_PD10C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PD10C_SERCOM1_PAD2                  ((PIN_PD10C_SERCOM1_PAD2 << 16) | MUX_PD10C_SERCOM1_PAD2)
#define PORT_PD10C_SERCOM1_PAD2                    (_UINT32_(1) << 10)

#define PIN_PD11C_SERCOM1_PAD3                     _UINT32_(107)
#define MUX_PD11C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PD11C_SERCOM1_PAD3                  ((PIN_PD11C_SERCOM1_PAD3 << 16) | MUX_PD11C_SERCOM1_PAD3)
#define PORT_PD11C_SERCOM1_PAD3                    (_UINT32_(1) << 11)

/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PC11D_SERCOM2_PAD0                     _UINT32_(75)
#define MUX_PC11D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM2_PAD0                  ((PIN_PC11D_SERCOM2_PAD0 << 16) | MUX_PC11D_SERCOM2_PAD0)
#define PORT_PC11D_SERCOM2_PAD0                    (_UINT32_(1) << 11)

#define PIN_PC06C_SERCOM2_PAD0                     _UINT32_(70)
#define MUX_PC06C_SERCOM2_PAD0                     _UINT32_(2) 
#define PINMUX_PC06C_SERCOM2_PAD0                  ((PIN_PC06C_SERCOM2_PAD0 << 16) | MUX_PC06C_SERCOM2_PAD0)
#define PORT_PC06C_SERCOM2_PAD0                    (_UINT32_(1) << 6)

#define PIN_PC10D_SERCOM2_PAD1                     _UINT32_(74)
#define MUX_PC10D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PC10D_SERCOM2_PAD1                  ((PIN_PC10D_SERCOM2_PAD1 << 16) | MUX_PC10D_SERCOM2_PAD1)
#define PORT_PC10D_SERCOM2_PAD1                    (_UINT32_(1) << 10)

#define PIN_PC07C_SERCOM2_PAD1                     _UINT32_(71)
#define MUX_PC07C_SERCOM2_PAD1                     _UINT32_(2) 
#define PINMUX_PC07C_SERCOM2_PAD1                  ((PIN_PC07C_SERCOM2_PAD1 << 16) | MUX_PC07C_SERCOM2_PAD1)
#define PORT_PC07C_SERCOM2_PAD1                    (_UINT32_(1) << 7)

#define PIN_PC12D_SERCOM2_PAD2                     _UINT32_(76)
#define MUX_PC12D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM2_PAD2                  ((PIN_PC12D_SERCOM2_PAD2 << 16) | MUX_PC12D_SERCOM2_PAD2)
#define PORT_PC12D_SERCOM2_PAD2                    (_UINT32_(1) << 12)

#define PIN_PC09C_SERCOM2_PAD2                     _UINT32_(73)
#define MUX_PC09C_SERCOM2_PAD2                     _UINT32_(2) 
#define PINMUX_PC09C_SERCOM2_PAD2                  ((PIN_PC09C_SERCOM2_PAD2 << 16) | MUX_PC09C_SERCOM2_PAD2)
#define PORT_PC09C_SERCOM2_PAD2                    (_UINT32_(1) << 9)

#define PIN_PC13D_SERCOM2_PAD3                     _UINT32_(77)
#define MUX_PC13D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM2_PAD3                  ((PIN_PC13D_SERCOM2_PAD3 << 16) | MUX_PC13D_SERCOM2_PAD3)
#define PORT_PC13D_SERCOM2_PAD3                    (_UINT32_(1) << 13)

/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PC07D_SERCOM3_PAD0                     _UINT32_(71)
#define MUX_PC07D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PC07D_SERCOM3_PAD0                  ((PIN_PC07D_SERCOM3_PAD0 << 16) | MUX_PC07D_SERCOM3_PAD0)
#define PORT_PC07D_SERCOM3_PAD0                    (_UINT32_(1) << 7)

#define PIN_PC02C_SERCOM3_PAD0                     _UINT32_(66)
#define MUX_PC02C_SERCOM3_PAD0                     _UINT32_(2) 
#define PINMUX_PC02C_SERCOM3_PAD0                  ((PIN_PC02C_SERCOM3_PAD0 << 16) | MUX_PC02C_SERCOM3_PAD0)
#define PORT_PC02C_SERCOM3_PAD0                    (_UINT32_(1) << 2)

